## Built-in Functions

In [1]:
%load_ext sql
%sql ibm_db_sa://mpc82210:7rf3d7vvlfj%5Egf7d@dashdb-txn-sbox-yp-dal09-10.services.dal.bluemix.net:50000/BLUDB

In [4]:
%sql SELECT * FROM PETRESCUE

 * ibm_db_sa://mpc82210:***@dashdb-txn-sbox-yp-dal09-10.services.dal.bluemix.net:50000/BLUDB
Done.

[(1, 'Cat', 9, Decimal('450.09'), datetime.date(2018, 5, 29)),
 (2, 'Dog', 3, Decimal('666.66'), datetime.date(2018, 6, 1)),
 (3, 'Dog', 1, Decimal('100.00'), datetime.date(2018, 6, 4)),
 (4, 'Parrot', 2, Decimal('50.00'), datetime.date(2018, 6, 4)),
 (5, 'Dog', 1, Decimal('75.75'), datetime.date(2018, 6, 10)),
 (6, 'Hamster', 6, Decimal('60.60'), datetime.date(2018, 6, 11)),
 (7, 'Cat', 1, Decimal('44.44'), datetime.date(2018, 6, 11)),
 (8, 'Goldfish', 24, Decimal('48.48'), datetime.date(2018, 6, 14)),
 (9, 'Dog', 2, Decimal('222.22'), datetime.date(2018, 6, 15))]

### SUM()

In [3]:
%sql SELECT SUM(COST) AS SUM_OF_COST FROM PETRESCUE

 * ibm_db_sa://mpc82210:***@dashdb-txn-sbox-yp-dal09-10.services.dal.bluemix.net:50000/BLUDB
Done.

[(Decimal('1718.24'),)]

### MIN(), MAX() AND AS

In [10]:
%sql SELECT MIN(ID) AS MINIMUM_INDEX_DOGS FROM PETRESCUE WHERE ANIMAL = 'Dog'

 * ibm_db_sa://mpc82210:***@dashdb-txn-sbox-yp-dal09-10.services.dal.bluemix.net:50000/BLUDB
Done.

[(2,)]

### OPERATIONS WITH COLUMNS

In [20]:
%sql SELECT ANIMAL, COST/QUANTITY FROM PETRESCUE

 * ibm_db_sa://mpc82210:***@dashdb-txn-sbox-yp-dal09-10.services.dal.bluemix.net:50000/BLUDB
Done.

[('Cat', Decimal('50.010000000000000000000000000')),
 ('Dog', Decimal('222.220000000000000000000000000')),
 ('Dog', Decimal('100.000000000000000000000000000')),
 ('Parrot', Decimal('25.000000000000000000000000000')),
 ('Dog', Decimal('75.750000000000000000000000000')),
 ('Hamster', Decimal('10.100000000000000000000000000')),
 ('Cat', Decimal('44.440000000000000000000000000')),
 ('Goldfish', Decimal('2.020000000000000000000000000')),
 ('Dog', Decimal('111.110000000000000000000000000'))]

### ROUND()

In [26]:
%sql SELECT ROUND(COST) FROM PETRESCUE

 * ibm_db_sa://mpc82210:***@dashdb-txn-sbox-yp-dal09-10.services.dal.bluemix.net:50000/BLUDB
Done.

[(Decimal('450.00'),),
 (Decimal('667.00'),),
 (Decimal('100.00'),),
 (Decimal('50.00'),),
 (Decimal('76.00'),),
 (Decimal('61.00'),),
 (Decimal('44.00'),),
 (Decimal('48.00'),),
 (Decimal('222.00'),)]

### LENGHT()

In [23]:
%sql SELECT LENGTH(ANIMAL) FROM PETRESCUE

 * ibm_db_sa://mpc82210:***@dashdb-txn-sbox-yp-dal09-10.services.dal.bluemix.net:50000/BLUDB
Done.

[(3,), (3,), (3,), (6,), (3,), (7,), (3,), (8,), (3,)]

### UCASE

In [24]:
%sql SELECT UCASE(ANIMAL) FROM PETRESCUE

 * ibm_db_sa://mpc82210:***@dashdb-txn-sbox-yp-dal09-10.services.dal.bluemix.net:50000/BLUDB
Done.

[('CAT',),
 ('DOG',),
 ('DOG',),
 ('PARROT',),
 ('DOG',),
 ('HAMSTER',),
 ('CAT',),
 ('GOLDFISH',),
 ('DOG',)]

### LCASE

In [25]:
%sql SELECT LCASE(ANIMAL) FROM PETRESCUE

 * ibm_db_sa://mpc82210:***@dashdb-txn-sbox-yp-dal09-10.services.dal.bluemix.net:50000/BLUDB
Done.

[('cat',),
 ('dog',),
 ('dog',),
 ('parrot',),
 ('dog',),
 ('hamster',),
 ('cat',),
 ('goldfish',),
 ('dog',)]

### DISTINCT()

In [28]:
%sql SELECT DISTINCT(LCASE(ANIMAL)) FROM PETRESCUE

 * ibm_db_sa://mpc82210:***@dashdb-txn-sbox-yp-dal09-10.services.dal.bluemix.net:50000/BLUDB
Done.

[('cat',), ('dog',), ('goldfish',), ('hamster',), ('parrot',)]

#### AVG()

In [29]:
%sql SELECT AVG(COST) FROM PETRESCUE

 * ibm_db_sa://mpc82210:***@dashdb-txn-sbox-yp-dal09-10.services.dal.bluemix.net:50000/BLUDB
Done.

[(Decimal('190.915555555555555555555555555'),)]